#+PROPERTY: NAME Slim Shady
* 1a
  :PROPERTIES:
  :lettergrade: A
  :END:
* 1b
  :PROPERTIES:
  :lettergrade: B
  :END:
* 2
  :PROPERTIES:
  :lettergrade: R
  :END:
#+BEGIN_SRC python
print 3

#+END_SRC

#+RESULTS:
: 3

* 3
  :PROPERTIES:
  :lettergrade: A
  :END:

